//
//  Squere.cpp
//  ТП3
//
//  Created by mak on 02.05.2023.
//

//Определить абстрактный базовый класс «Печатное издание», для которого
//существует наименование, год издания, наименование издательства, количество страниц,
//аннотация; определить метод вывода на экран.

#include "abst.hpp"
void AbstracktCLASS::print()
{

    cout << "\t";
    
}


AbstracktCLASS::~AbstracktCLASS() {
    
cout << "\n";
    
   
    
}
