//
//  Squere.cpp
//  ТП3
//
//  Created by mak on 02.05.2023.
//


//Создать абстрактный базовый класс с виртуальной функцией «Площадь».
#include "Squere.hpp"
double SQUERE::Square()
{
return 0.0;
    
}
SQUERE::~SQUERE() {
    
cout << "\n" << std::endl;
    
   
    
}
